[{
      "assignee": "<RelCo>",
      "component": "Relco tasks",
      "description": "Everything we need to do before taking over production of the <Division> division",
      "subtasks": [{
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "If their master database is not deemed suitable, make a new one with the {{ensembl-compara/scripts/production/make_a_master.sh}} script",
            "summary": "Creation of a new master database"
         },
         {
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "Make sure the master database is complete and sane",
            "summary": "Healthcheck the master database"
         },
         {
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "Find the last production databases they used, and copy them on our server",
            "summary": "Copy the last production databases"
         },
         {
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "Also check that the whole-genome alignments are in the range of their mlss_id",
            "summary": "Copy and healthcheck the last release database"
         },
         {
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "With the help of the <Division> team, identify the patterns of whole-genome alignments and encode the rules in a new XML configuration file. Add the extra analyses such as protein-trees",
            "summary": "Write an XML configuration file for the division"
         },
         {
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "e.g. LastZ parameters used for which clades, whether they run CAFE or not, etc",
            "summary": "Gather specific parameters used by the <Division> team"
         },
         {
            "assignee": "<RelCo>",
            "component": "Relco tasks",
            "description": "It is likely that not all species have been aligned to the right species. create_all_mlss.pl will create the missing MethodLinkSpeciesSets. Those alignments will have to be run for the first production cycle but can often be started earlier",
            "summary": "Run create_all_mlss.pl and schedule the missing LastZ alignments"
         }
      ],
      "summary": "Migration of the <Division> production"
   }
]
